# Transmittance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisWindowType..::..Transmittance Property
EnergyAnalysisWindowType Class See Also
---
The visual light transmittance value (VLT-value) for the window type.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double Transmittance { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Transmittance As Double
	Get
```

Visual C++
---
```text
public:
property double Transmittance {
	double get ();
}
```

# See Also
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace